In [10]:
import numpy as np
import pandas as pd
arreglo =np.array([["Bella","Labrador","Café",56,24,"2013-07-02"],
                   ["Charlie","Poodle","Negro",43,24,"2016-09-16"],
                   ["Lucya","Chow Chow","Café",46,24,"2014-08-25"],
                   ["Cooper","Schnauzer","Gris",49,17,"2011-12-11"],
                   ["Bernie","San Bernardo","Blanco",77,74,"2011-12-11"],
                  ["Max","Chow Chow","Blanco",45,28,"2019-03-27"],
                  ["Reed","Schnauzer","Negro",45,15,"2017-09-18"]])
arreglo

array([['Bella', 'Labrador', 'Café', '56', '24', '2013-07-02'],
       ['Charlie', 'Poodle', 'Negro', '43', '24', '2016-09-16'],
       ['Lucya', 'Chow Chow', 'Café', '46', '24', '2014-08-25'],
       ['Cooper', 'Schnauzer', 'Gris', '49', '17', '2011-12-11'],
       ['Bernie', 'San Bernardo', 'Blanco', '77', '74', '2011-12-11'],
       ['Max', 'Chow Chow', 'Blanco', '45', '28', '2019-03-27'],
       ['Reed', 'Schnauzer', 'Negro', '45', '15', '2017-09-18']],
      dtype='<U12')

In [14]:
df=pd.DataFrame(data=arreglo,columns=["Nombre","Raza","Color","Altura_cm","Peso_kg","Fecha_Nac"])
df["Altura_cm"]=df["Altura_cm"].astype(int)
df["Peso_kg"]=df["Peso_kg"].astype(int)
df

    Nombre          Raza   Color  Altura_cm  Peso_kg   Fecha_Nac
0    Bella      Labrador    Café         56       24  2013-07-02
1  Charlie        Poodle   Negro         43       24  2016-09-16
2    Lucya     Chow Chow    Café         46       24  2014-08-25
3   Cooper     Schnauzer    Gris         49       17  2011-12-11
4   Bernie  San Bernardo  Blanco         77       74  2011-12-11
5      Max     Chow Chow  Blanco         45       28  2019-03-27
6     Reed     Schnauzer   Negro         45       15  2017-09-18

In [16]:
df["Peso_kg"].mean()

29.428571428571427

In [18]:
df["Fecha_Nac"].min()

'2011-12-11'

In [22]:
def percentil80(columna):
    return columna.quantile(0.80)

df["Altura_cm"].agg(percentil80)

54.60000000000001

In [26]:
df[["Altura_cm","Peso_kg"]].agg(percentil80)

Altura_cm    54.6
Peso_kg      27.2
dtype: float64

In [30]:
def percentil90(columna):
    return columna.quantile(0.90)

df["Altura_cm"].agg([percentil80,percentil90])

percentil80    54.6
percentil90    64.4
Name: Altura_cm, dtype: float64

In [32]:
df["Altura_cm"]

0    56
1    43
2    46
3    49
4    77
5    45
6    45
Name: Altura_cm, dtype: int32

In [34]:
df["Altura_cm"].cumsum()

0     56
1     99
2    145
3    194
4    271
5    316
6    361
Name: Altura_cm, dtype: int32

In [36]:
df["Altura_cm"].cummin()

0    56
1    43
2    43
3    43
4    43
5    43
6    43
Name: Altura_cm, dtype: int32

In [38]:
df["Raza"].value_counts()

Raza
Chow Chow       2
Schnauzer       2
Labrador        1
Poodle          1
San Bernardo    1
Name: count, dtype: int64

In [40]:
df["Raza"].value_counts(normalize=True)

Raza
Chow Chow       0.285714
Schnauzer       0.285714
Labrador        0.142857
Poodle          0.142857
San Bernardo    0.142857
Name: proportion, dtype: float64

In [50]:
df.groupby("Color")["Peso_kg"].mean()

Color
Blanco    51.0
Café      24.0
Gris      17.0
Negro     19.5
Name: Peso_kg, dtype: float64

In [54]:
df.groupby("Color")["Peso_kg"].agg(["min", "max", "sum"])

        min  max  sum
Color
Blanco   28   74  102
Café     24   24   48
Gris     17   17   17
Negro    15   24   39

In [58]:
df.groupby(["Color","Raza"])["Peso_kg"].mean()

Color   Raza
Blanco  Chow Chow       28.0
        San Bernardo    74.0
Café    Chow Chow       24.0
        Labrador        24.0
Gris    Schnauzer       17.0
Negro   Poodle          24.0
        Schnauzer       15.0
Name: Peso_kg, dtype: float64

In [60]:
df.pivot_table(values="Peso_kg",index="Color",columns="Raza")

Raza    Chow Chow  Labrador  Poodle  San Bernardo  Schnauzer
Color
Blanco       28.0       NaN     NaN          74.0        NaN
Café         24.0      24.0     NaN           NaN        NaN
Gris          NaN       NaN     NaN           NaN       17.0
Negro         NaN       NaN    24.0           NaN       15.0

In [62]:
df.pivot_table(values="Peso_kg",index="Color",columns="Raza",fill_value=0)

Raza    Chow Chow  Labrador  Poodle  San Bernardo  Schnauzer
Color
Blanco       28.0       0.0     0.0          74.0        0.0
Café         24.0      24.0     0.0           0.0        0.0
Gris          0.0       0.0     0.0           0.0       17.0
Negro         0.0       0.0    24.0           0.0       15.0

In [66]:
df.pivot_table(values="Peso_kg",index="Color",columns="Raza",fill_value=0,margins=True,aggfunc=np.mean()

SyntaxError: incomplete input (3195716119.py, line 1)